## MySQL

For each of these packages, we've used one package to facilitate a connection to the database and then the same package to manipulate it. 

In this case, we're going to use pymysql and sqlalchemy to establish the connection, and regular old pandas to perform our inserts.

In [19]:
!pip install sqlalchemy
!pip install pymysql

Requirement already satisfied: sqlalchemy in /Users/ben/anaconda3/lib/python3.7/site-packages (1.3.13)
Requirement already satisfied: pymysql in /Users/ben/anaconda3/lib/python3.7/site-packages (1.0.2)

I've saved my password off-screen. This is the password that you set up for your MySQL instance at the beginning! 

User will be root. Port is 3306, which is googleable - the default port for mysql.

In [20]:
import pymysql
#Create the engine by connecting to the database 
conn = pymysql.connect(host='127.0.0.1',
                       port=3306,
                        user='root',
                      password=password,
                       db='launch'
)

In [21]:
from sqlalchemy import create_engine
cnx = create_engine('mysql+pymysql://root:'+password+'@localhost:3306/launch')

## Inserting data

Now that we've created our chart, we can add our data into it. We have two main options here: create the tables directly from our dataframes (and let MySQL guess at datatypes), or create the schemae first in MySQL and then add them in.

In [26]:
import pandas as pd

people = ['Daniel Willson', 'Kaleigh Watson', 'Amanda Coombs', "Andy Page"]
role = ['VPP', 'LPD', 'COO', 'ED']
workplace = [1,1,1,1]
alma_mater = [2,2,2,2]

people = pd.DataFrame({'name':people, 'role':role, 'workplace_id':workplace, 'alma_mater_id':alma_mater})

In [27]:
#notice we're manually constructing our id column here!
schools = pd.DataFrame({'name':['UVA', 'VT'], 'type':['Public', 'Public'], 'id':[2, 1]})
schools

  name    type  id
0  UVA  Public   2
1   VT  Public   1

In [28]:
#Companies
companies = pd.DataFrame({'name':['Astraea', 'Forge'], 'location':['Charlottesville', 'Charlottesville'], 'id':[2, 1]})
companies

      name         location  id
0  Astraea  Charlottesville   2
1    Forge  Charlottesville   1

Let's just insert as is. They'll have their own primary keys and datatypes, which we can later reassign. 

We can also notate primary keys through tableplus.

In [32]:
people.to_sql(name='people', con=cnx, if_exists='append', index=True)
companies.to_sql(name='companies', con=cnx, if_exists='append', index=False)
schools.to_sql(name='schools', con=cnx, if_exists='append', index=False)

We then use the GUI menus to reassign datatypes and foreign keys. If you're feeling fancy, see if there are ways to do this from python!

In [33]:
#Querying
pd.read_sql("SELECT * from people", con=cnx)

   index            name role  workplace_id  alma_mater_id
0      0  Daniel Willson  VPP             1              2
1      1  Kaleigh Watson  LPD             1              2
2      2   Amanda Coombs  COO             1              2
3      3       Andy Page   ED             1              2

In [36]:
pd.read_sql("SELECT * from people JOIN companies on people.workplace_id=companies.id JOIN schools ", con = cnx)

,index,name,role,workplace_id,alma_mater_id,name,location,id
0,0,Daniel Willson,VPP,1,2,Forge,Charlottesville,1
1,1,Kaleigh Watson,LPD,1,2,Forge,Charlottesville,1
2,2,Amanda Coombs,COO,1,2,Forge,Charlottesville,1
3,3,Andy Page,ED,1,2,Forge,Charlottesville,1